identification division.
  program-id. foo.
environment division.
data division.
  working-storage section.
procedure division.
    display 'foo'.


end program foo.
